
## Plan Result (stg)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 12 to change, 1 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.vm-admin[5]
  * module.sa-migration-standard[0].time_rotating.rotate
* Update
  * azurerm_subnet.migration[0]
  * azurerm_subnet.postgres[0]
  * azurerm_windows_virtual_machine.modernisation_windows[&#34;stgdartsmidmock&#34;]
  * module.darts_redis.azurerm_redis_cache.redis
  * module.sa.azapi_update_resource.defender_settings
  * module.sa.azurerm_storage_account.storage_account
  * module.sa-dets-standard[0].azapi_update_resource.defender_settings
  * module.sa-dets-standard[0].azurerm_storage_account.storage_account
  * module.sa-migration-standard[0].azapi_update_resource.defender_settings
  * module.sa-migration-standard[0].azurerm_storage_account.storage_account
  * module.sa_dets[0].azapi_update_resource.defender_settings
  * module.sa_dets[0].azurerm_storage_account.storage_account
* Replace
  * module.sa-migration-standard[0].time_static.pim_expiry


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.vm-admin[5] will be created
  + resource "azurerm_role_assignment" "vm-admin" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "cd395cb0-35d7-454b-8c99-26422f78901e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine Administrator Login"
      + scope                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Compute/virtualMachines/migration-vm"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_subnet.migration[0] will be updated in-place
  ~ resource "azurerm_subnet" "migration" {
        id                                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Network/virtualNetworks/migration-vnet/subnets/migration-subnet"
        name                                          = "migration-subnet"
      ~ private_endpoint_network_policies             = "Enabled" -> "Disabled"
        # (7 unchanged attributes hidden)
    }

  # azurerm_subnet.postgres[0] will be updated in-place
  ~ resource "azurerm_subnet" "postgres" {
        id                                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Network/virtualNetworks/migration-vnet/subnets/postgres-sn"
        name                                          = "postgres-sn"
      ~ private_endpoint_network_policies             = "Enabled" -> "Disabled"
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_windows_virtual_machine.modernisation_windows["stgdartsmidmock"] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "modernisation_windows" {
        id                                                     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.Compute/virtualMachines/stgdartsmidmock"
        name                                                   = "stgdartsmidmock"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
        # (41 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.darts_redis.azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                                 = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.Cache/redis/darts-stg"
        name                               = "darts-stg"
        tags                               = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
        # (24 unchanged attributes hidden)

      ~ redis_configuration {
          - data_persistence_authentication_method  = "SAS" -> null
            # (16 unchanged attributes hidden)
        }
    }

  # module.sa.azapi_update_resource.defender_settings will be updated in-place
  ~ resource "azapi_update_resource" "defender_settings" {
      ~ body                    = jsonencode(
            {
              - properties = {
                  - isEnabled                         = false
                  - malwareScanning                   = {
                      - onUpload = {
                          - capGBPerMonth = -1
                          - isEnabled     = false
                        }
                    }
                  - overrideSubscriptionLevelSettings = true
                  - sensitiveDataDiscovery            = {
                      - isEnabled = false
                    }
                }
            }
        ) -> {
          + properties = {
              + isEnabled                         = false
              + malwareScanning                   = {
                  + onUpload = {
                      + capGBPerMonth = -1
                      + isEnabled     = false
                    }
                }
              + overrideSubscriptionLevelSettings = true
              + sensitiveDataDiscovery            = {
                  + isEnabled = false
                }
            }
        }
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.Storage/storageAccounts/dartssastg/providers/Microsoft.Security/DefenderForStorageSettings/current"
        name                    = "current"
      ~ output                  = jsonencode({}) -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.sa.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
      ~ cross_tenant_replication_enabled   = true -> false
        id                                 = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.Storage/storageAccounts/dartssastg"
        name                               = "dartssastg"
        tags                               = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
        # (95 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

  # module.sa-dets-standard[0].azapi_update_resource.defender_settings will be updated in-place
  ~ resource "azapi_update_resource" "defender_settings" {
      ~ body                    = jsonencode(
            {
              - properties = {
                  - isEnabled                         = false
                  - malwareScanning                   = {
                      - onUpload = {
                          - capGBPerMonth = -1
                          - isEnabled     = false
                        }
                    }
                  - overrideSubscriptionLevelSettings = true
                  - sensitiveDataDiscovery            = {
                      - isEnabled = false
                    }
                }
            }
        ) -> {
          + properties = {
              + isEnabled                         = false
              + malwareScanning                   = {
                  + onUpload = {
                      + capGBPerMonth = -1
                      + isEnabled     = false
                    }
                }
              + overrideSubscriptionLevelSettings = true
              + sensitiveDataDiscovery            = {
                  + isEnabled = false
                }
            }
        }
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.Storage/storageAccounts/stgdetsdarts/providers/Microsoft.Security/DefenderForStorageSettings/current"
        name                    = "current"
      ~ output                  = jsonencode({}) -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.sa-dets-standard[0].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
      ~ cross_tenant_replication_enabled   = true -> false
        id                                 = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.Storage/storageAccounts/stgdetsdarts"
        name                               = "stgdetsdarts"
        tags                               = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
        # (95 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sa-migration-standard[0].azapi_update_resource.defender_settings will be updated in-place
  ~ resource "azapi_update_resource" "defender_settings" {
      ~ body                    = jsonencode(
            {
              - properties = {
                  - isEnabled                         = false
                  - malwareScanning                   = {
                      - onUpload = {
                          - capGBPerMonth = -1
                          - isEnabled     = false
                        }
                    }
                  - overrideSubscriptionLevelSettings = true
                  - sensitiveDataDiscovery            = {
                      - isEnabled = false
                    }
                }
            }
        ) -> {
          + properties = {
              + isEnabled                         = false
              + malwareScanning                   = {
                  + onUpload = {
                      + capGBPerMonth = -1
                      + isEnabled     = false
                    }
                }
              + overrideSubscriptionLevelSettings = true
              + sensitiveDataDiscovery            = {
                  + isEnabled = false
                }
            }
        }
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Storage/storageAccounts/sastgdartsmig02/providers/Microsoft.Security/DefenderForStorageSettings/current"
        name                    = "current"
      ~ output                  = jsonencode({}) -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.sa-migration-standard[0].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
      ~ cross_tenant_replication_enabled   = true -> false
        id                                 = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Storage/storageAccounts/sastgdartsmig02"
        name                               = "sastgdartsmig02"
        tags                               = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
        # (95 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sa-migration-standard[0].time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.sa-migration-standard[0].time_static.pim_expiry must be replaced
-/+ resource "time_static" "pim_expiry" {
      ~ day     = 9 -> (known after apply)
      ~ hour    = 12 -> (known after apply)
      ~ id      = "2025-01-09T12:36:03Z" -> (known after apply)
      ~ minute  = 36 -> (known after apply)
      ~ month   = 1 -> (known after apply)
      ~ rfc3339 = "2025-01-09T12:36:03Z" -> (known after apply) # forces replacement
      ~ second  = 3 -> (known after apply)
      ~ unix    = 1736426163 -> (known after apply)
      ~ year    = 2025 -> (known after apply)
    }

  # module.sa_dets[0].azapi_update_resource.defender_settings will be updated in-place
  ~ resource "azapi_update_resource" "defender_settings" {
      ~ body                    = jsonencode(
            {
              - properties = {
                  - isEnabled                         = false
                  - malwareScanning                   = {
                      - onUpload = {
                          - capGBPerMonth = -1
                          - isEnabled     = false
                        }
                    }
                  - overrideSubscriptionLevelSettings = true
                  - sensitiveDataDiscovery            = {
                      - isEnabled = false
                    }
                }
            }
        ) -> {
          + properties = {
              + isEnabled                         = false
              + malwareScanning                   = {
                  + onUpload = {
                      + capGBPerMonth = -1
                      + isEnabled     = false
                    }
                }
              + overrideSubscriptionLevelSettings = true
              + sensitiveDataDiscovery            = {
                  + isEnabled = false
                }
            }
        }
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Storage/storageAccounts/sastgdartsartefacts/providers/Microsoft.Security/DefenderForStorageSettings/current"
        name                    = "current"
      ~ output                  = jsonencode({}) -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.sa_dets[0].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
      ~ cross_tenant_replication_enabled   = true -> false
        id                                 = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Storage/storageAccounts/sastgdartsartefacts"
        name                               = "sastgdartsartefacts"
        tags                               = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
        # (95 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 3 to add, 12 to change, 1 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.sa-migration-standard[0].time_rotating.rotate has been deleted
  - resource "time_rotating" "rotate" {
        id               = "2024-01-15T12:36:03Z"
      - rotation_rfc3339 = "2025-01-09T12:36:03Z" -> null
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":324,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->